Core/src/Documents/КадровоеПеремещение/КадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КадровоеПеремещение</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияИУдержания</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКадровоеПеремещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчастникПенсионногоФонда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетДобровольно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <type>
        <types>CatalogRef.AzRyDivision</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ВидыОперацийКадровоеПеремещение/ВидыОперацийКадровоеПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКадровоеПеремещение</name>
  <enumValues>
    <name>ПеремещениеИИзменениеСпособаОплаты</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпособаОплаты</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНачисленийИУдержаний/ТипыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНачисленийИУдержаний</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
  <enumValues>
    <name>Налог</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеПФ</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеДляКонтрагента</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/ВидыНачисленийИУдержаний/ВидыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНачисленийИУдержаний</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>Взносы в ПФР  с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Взносы в ПФР- накопительная часть(до 2014 года)</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Взносы в ПФР- страховая часть(до 2014 года)</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Взносы в ФСС (временная нетрудоспособность)</description>
    </items>
    <items>
      <name>ФССНесчастныеСлучаи</name>
      <description>Взносы в ФСС (несчастные случаи)</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Взносы в ФФОМС</description>
    </items>
    <items>
      <name>НалогНаДоходы</name>
      <description>Налог на доходы</description>
    </items>
    <items>
      <name>НДФЛКВыплате</name>
      <description>НДФЛ К Выплате</description>
    </items>
    <items>
      <name>НДФЛНачисленный</name>
      <description>НДФЛ Начисленный</description>
    </items>
    <items>
      <name>ПогашениеЗаймаИзЗарплаты</name>
      <description>Погашение займа из зарплаты</description>
    </items>
    <items>
      <name>ПроцентыПоЗайму</name>
      <description>Проценты по займу</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата</description>
    </items>
    <items>
      <name>СдельнаяОплатаПроцент</name>
      <description>Сдельная оплата (процент)</description>
    </items>
    <items>
      <name>ФиксированнаяСумма</name>
      <description>Сдельная оплата (фиксированная сумма)</description>
    </items>
    <items>
      <name>ФиксированныйПроцент</name>
      <description>ფიქსირებული პროცენტი</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.КодыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаПоСтраховымВзносам</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалогаВыплат</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПенсионныйНалогСотрудника</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПенсионныйНалогОрганизации</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRytmpСтавкаНалогаНаДоходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/Documents/КадровоеПеремещение/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКадровоеПеремещение, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник,
	|	КадровоеПеремещениеСотрудники.СтруктурнаяЕдиница,
	|	КадровоеПеремещениеСотрудники.Должность,
	|	КадровоеПеремещениеСотрудники.ГрафикРаботы,
	|	КадровоеПеремещениеСотрудники.ЗанимаемыхСтавок,
	|	КадровоеПеремещениеСотрудники.Период,
	//Паганини_
	|	КадровоеПеремещениеСотрудники.КлючСвязи,
	|	КадровоеПеремещениеСотрудники.УчастникПенсионногоФонда,
	|	КадровоеПеремещениеСотрудники.ВидУдержанияПФ,
	|	КадровоеПеремещениеСотрудники.УчаствуетДобровольно,
	//_Паганини
	|	КадровоеПеремещениеСотрудники.Ссылка
	|ПОМЕСТИТЬ ТаблицаСотрудники
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период,
	|	КадровоеПеремещениеНачисленияУдержания.ВидНачисленияУдержания КАК ВидНачисленияУдержания,
	|	КадровоеПеремещениеНачисленияУдержания.Валюта,
	|	КадровоеПеремещениеНачисленияУдержания.Сумма КАК Сумма,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатрат,
	|	КадровоеПеремещениеНачисленияУдержания.СчетЗатратРегл,//+++ Дмгг
	|	КадровоеПеремещениеНачисленияУдержания.Актуальность
	|ПОМЕСТИТЬ ТаблицаНачисленияУдержания
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НачисленияУдержания КАК КадровоеПеремещениеНачисленияУдержания
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНачисленияУдержания.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНачисленияУдержания.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	КадровоеПеремещениеСотрудники.НомерСтроки,
	|	КадровоеПеремещениеСотрудники.Сотрудник,
	|	КадровоеПеремещениеСотрудники.Период,
	|	КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания,
	|	КадровоеПеремещениеНалогиНаДоходы.Валюта,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО, //+++ Дмгг
	|	КадровоеПеремещениеНалогиНаДоходы.Актуальность
	|ИЗ
	|	Документ.КадровоеПеремещение.Сотрудники КАК КадровоеПеремещениеСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|		ПО КадровоеПеремещениеСотрудники.КлючСвязи = КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|ГДЕ
	|	КадровоеПеремещениеСотрудники.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|;
	|
	//Паганини_
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи,
	|	МАКСИМУМ(КадровоеПеремещениеНалогиНаДоходы.ВидНачисленияУдержания) КАК ВидУдержанияНДФЛ
	|ПОМЕСТИТЬ ТаблицаСтавкиНДФЛ
	|ИЗ
	|	Документ.КадровоеПеремещение.НалогиНаДоходы КАК КадровоеПеремещениеНалогиНаДоходы
	|ГДЕ
	|	КадровоеПеремещениеНалогиНаДоходы.Ссылка = &Ссылка
	|	И КадровоеПеремещениеНалогиНаДоходы.Актуальность
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровоеПеремещениеНалогиНаДоходы.КлючСвязи
	|;
	//_Паганини
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСотрудники.Организация,
	|	ТаблицаСотрудники.НомерСтроки,
	|	ТаблицаСотрудники.Сотрудник,
	|	ТаблицаСотрудники.СтруктурнаяЕдиница,
	|	ТаблицаСотрудники.Должность,
	|	ТаблицаСотрудники.ГрафикРаботы,
	|	ТаблицаСотрудники.ЗанимаемыхСтавок,
	//Паганини_
	|	ЕСТЬNULL(ТаблицаСтавкиНДФЛ.ВидУдержанияНДФЛ, Значение(Справочник.ВидыНачисленийИУдержаний.ПустаяСсылка)) КАК ВидУдержанияНДФЛ,
	|	ТаблицаСотрудники.УчастникПенсионногоФонда,
	|	ТаблицаСотрудники.ВидУдержанияПФ,
	|	ТаблицаСотрудники.УчаствуетДобровольно,
	//_Паганини
	|	ТаблицаСотрудники.Период
	|ИЗ
	|	ТаблицаСотрудники КАК ТаблицаСотрудники
	//Паганини_
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСтавкиНДФЛ КАК ТаблицаСтавкиНДФЛ
	|		ПО ТаблицаСотрудники.КлючСвязи = ТаблицаСтавкиНДФЛ.КлючСвязи
	//_Паганини
	|ГДЕ
	|	ТаблицаСотрудники.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийКадровоеПеремещение.ПеремещениеИИзменениеСпособаОплаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачисленияУдержания.Организация,
	|	ТаблицаНачисленияУдержания.НомерСтроки,
	|	ТаблицаНачисленияУдержания.Сотрудник,
	|	ТаблицаНачисленияУдержания.Период,
	|	ТаблицаНачисленияУдержания.ВидНачисленияУдержания,
	|	ТаблицаНачисленияУдержания.Валюта,
	|	ТаблицаНачисленияУдержания.Сумма,
	|	ТаблицаНачисленияУдержания.СчетЗатрат,
	|	ТаблицаНачисленияУдержания.СчетЗатратРегл, //+++ Дмгг
	|	ТаблицаНачисленияУдержания.Актуальность
	|ИЗ
	|	ТаблицаНачисленияУдержания КАК ТаблицаНачисленияУдержания");
	                
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКадровоеПеремещение);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСотрудники", 				МассивРезультатов[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПлановыеНачисленияИУдержания", МассивРезультатов[4].Выгрузить());
	
	СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

Процедура СформироватьКадровыйПриказ(ОписаниеПечатнойФормы, МассивОбъектов, ОбъектыПечати) Экспорт
	Перем Ошибки, ПервыйДокумент, НомерСтрокиНачало;
	
	Макет				= УправлениеПечатью.МакетПечатнойФормы(ОписаниеПечатнойФормы.ПолныйПутьКМакету);
	ТабличныйДокумент	= ОписаниеПечатнойФормы.ТабличныйДокумент;
	ДанныеПечати		= Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
	"Выбрать
	|	ОбщиеСведенияОПеремещении.Ссылка
	|	,ОбщиеСведенияОПеремещении.Номер
	|	,ОбщиеСведенияОПеремещении.Дата КАК ДатаДокумента
	|	,ОбщиеСведенияОПеремещении.Организация КАК Организация
	|	,ОбщиеСведенияОПеремещении.Организация.Префикс КАК Префикс
	|	,ОбщиеСведенияОПеремещении.Организация.КодПоОКПО КАК КодПоОКПО
	|	,ОбщиеСведенияОПеремещении.ПодписьРуководителя.Должность КАК ДолжностьРуководителя
	|	,ОбщиеСведенияОПеремещении.ПодписьРуководителя.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи
	|Из Документ.КадровоеПеремещение КАК ОбщиеСведенияОПеремещении
	|Где ОбщиеСведенияОПеремещении.Ссылка В(&МассивОбъектов)
	|
	|;Выбрать
	|	СведенияОСотруникеПрошлогоПериода.Сотрудник КАК Сотрудник 
	|	,СведенияОСотруникеПрошлогоПериода.Организация КАК Организация
	|	,Максимум(СведенияОСотруникеПрошлогоПериода.Период) КАК ПериодПредыдущейЗаписи
	|Поместить ПериодыПредыдущихЗаписей
	|Из Документ.КадровоеПеремещение.Сотрудники КАК СведенияОСотрудниках
	|	Левое соединение РегистрСведений.Сотрудники КАК СведенияОСотруникеПрошлогоПериода
	|	По СведенияОСотрудниках.Ссылка.Организация = СведенияОСотруникеПрошлогоПериода.Организация
	|	И СведенияОСотрудниках.Сотрудник = СведенияОСотруникеПрошлогоПериода.Сотрудник
	|	И СведенияОСотрудниках.Период > СведенияОСотруникеПрошлогоПериода.Период
	|Где СведенияОСотрудниках.Ссылка В(&МассивОбъектов)
	|Сгруппировать по СведенияОСотруникеПрошлогоПериода.Сотрудник, СведенияОСотруникеПрошлогоПериода.Организация
	|
	|;Выбрать
	|	СведенияОСотрудниках.КлючСвязи КАК КлючСвязи
	|	,СведенияОСотрудниках.Период КАК ДатаПеревода
	|	,""постоянно"" КАК ВидПеревода
	|	,СведенияОСотрудниках.Сотрудник.Наименование КАК Работник
	|	,СведенияОСотрудниках.Сотрудник.Код КАК ТабельныйНомер
	|	,СведенияОСотруникеПрошлогоПериода.СтруктурнаяЕдиница КАК ПодразделениеПредыдущее
	|	,СведенияОСотруникеПрошлогоПериода.Должность.Наименование КАК ДолжностьПредыдущаяя
	|	,СведенияОСотрудниках.СтруктурнаяЕдиница КАК ПодразделениеНовое
	|	,СведенияОСотрудниках.Должность.Наименование КАК ДолжностьНовая
	|Из Документ.КадровоеПеремещение.Сотрудники КАК СведенияОСотрудниках
	|	Левое Соединение ПериодыПредыдущихЗаписей КАК ПериодыПредыдущихЗаписей
	|	По СведенияОСотрудниках.Ссылка.Организация = ПериодыПредыдущихЗаписей.Организация
	|		И СведенияОСотрудниках.Сотрудник = ПериодыПредыдущихЗаписей.Сотрудник
	|	Левое Соединение РегистрСведений.Сотрудники КАК СведенияОСотруникеПрошлогоПериода
	|	По СведенияОСотрудниках.Ссылка.Организация = СведенияОСотруникеПрошлогоПериода.Организация
	|		И СведенияОСотрудниках.Сотрудник = СведенияОСотруникеПрошлогоПериода.Сотрудник
	|		И ПериодыПредыдущихЗаписей.ПериодПредыдущейЗаписи = СведенияОСотруникеПрошлогоПериода.Период
	|Где СведенияОСотрудниках.Ссылка В(&МассивОбъектов)
	|
	|;Выбрать
	|	СведенияОНачислениях.КлючСвязи КАК КлючСвязи
	|	,СведенияОНачислениях.Сумма КАК СуммаНачисления
	|	,ВидНачисленияУдержания.Наименование КАК ПредставлениеНачисления
	|Из Документ.КадровоеПеремещение.НачисленияУдержания КАК СведенияОНачислениях
	|Где СведенияОНачислениях.Ссылка В(&МассивОбъектов)
	|	И СведенияОНачислениях.ВидНачисленияУдержания.Тип = Значение(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|Упорядочить по СведенияОНачислениях.НомерСтроки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОбщиеСведенияОПриеме = РезультатЗапроса[0].Выгрузить();
	СведенияОСотрудниках = РезультатЗапроса[2].Выгрузить();
	СведенияОНачислениях = РезультатЗапроса[3].Выгрузить();
	
	Для каждого ДанныеСотрудника Из СведенияОСотрудниках Цикл
		
		ПечатьДокументовУНФ.ПередНачаломФормированияДокумента(ТабличныйДокумент, ПервыйДокумент, НомерСтрокиНачало, ДанныеПечати);
		
		СведенияОбОрганизации = УправлениеНебольшойФирмойСервер.СведенияОЮрФизЛице(ОбщиеСведенияОПриеме[0].Организация, ОбщиеСведенияОПриеме[0].ДатаДокумента, ,);
		ДанныеПечати.Вставить("НазваниеОрганизации", УправлениеНебольшойФирмойСервер.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование"));
		ДанныеПечати.Вставить("КодПоОКПО", ОбщиеСведенияОПриеме[0].КодПоОКПО);
		ДанныеПечати.Вставить("НомерДокумента", ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ОбщиеСведенияОПриеме[0].ДатаДокумента, ОбщиеСведенияОПриеме[0].Номер, ОбщиеСведенияОПриеме[0].Префикс));
		ДанныеПечати.Вставить("ДатаДокумента", ОбщиеСведенияОПриеме[0].ДатаДокумента);
		
		ДанныеПечати.Вставить("ДатаНачала", ДанныеСотрудника.ДатаПеревода);
		ДанныеПечати.Вставить("ДатаОкончания", Неопределено);
		ДанныеПечати.Вставить("Работник", ДанныеСотрудника.Работник);
		ДанныеПечати.Вставить("ТабельныйНомер", ДанныеСотрудника.ТабельныйНомер);
		ДанныеПечати.Вставить("ВидПеревода", ДанныеСотрудника.ВидПеревода);
		ДанныеПечати.Вставить("ПодразделениеПредыдущее", ДанныеСотрудника.ПодразделениеПредыдущее);
		ДанныеПечати.Вставить("ДолжностьПредыдущаяя", ДанныеСотрудника.ДолжностьПредыдущаяя);
		ДанныеПечати.Вставить("ПодразделениеНовое", ДанныеСотрудника.ПодразделениеНовое);
		ДанныеПечати.Вставить("ДолжностьНовая", ДанныеСотрудника.ДолжностьНовая);
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("КлючСвязи", ДанныеСотрудника.КлючСвязи);
		
		ДанныеПечати.Вставить("ОкладТарифнаяСтавкаЦелаяЧасть", Неопределено);
		ДанныеПечати.Вставить("ОкладТарифнаяСтавкаДробнаяЧасть", Неопределено);
		ДанныеПечати.Вставить("Надбавка", Неопределено);
		ДанныеПечати.Вставить("ВалютаТарифнойСтавки", НСтр("ka='ლარი';ru='руб.';en='rub.'"));
		ДанныеПечати.Вставить("КопейкиТарифнойСтавки", НСтр("ka='ასლი';ru='коп.';en='коп.'"));
		
		ПорядковыйНомерНачисления = 0;
		
		НайденныеСтроки = СведенияОНачислениях.НайтиСтроки(СтруктураОтбора);
		Для каждого СтрокаНачисления Из НайденныеСтроки Цикл
			
			Если ПорядковыйНомерНачисления = 0 Тогда
				
				ДанныеПечати.ОкладТарифнаяСтавкаЦелаяЧасть = Цел(СтрокаНачисления.СуммаНачисления);
				ДанныеПечати.ОкладТарифнаяСтавкаДробнаяЧасть = Формат(СтрокаНачисления.СуммаНачисления - ДанныеПечати.ОкладТарифнаяСтавкаЦелаяЧасть, "ЧН=00");
				
				ПорядковыйНомерНачисления = ПорядковыйНомерНачисления + 1;
				
			ИначеЕсли ПорядковыйНомерНачисления = 1 Тогда
				
				ДанныеПечати.Надбавка  = СокрЛП(СтрокаНачисления.ПредставлениеНачисления) + ": " + Строка(СтрокаНачисления.СуммаНачисления);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеПечати.Вставить("ДолжностьРуководителя", ОбщиеСведенияОПриеме[0].ДолжностьРуководителя);
		ДанныеПечати.Вставить("РуководительРасшифровкаПодписи", ОбщиеСведенияОПриеме[0].РуководительРасшифровкаПодписи);
		
		Макет.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(Макет);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ОбщиеСведенияОПриеме[0].Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Приказ_Т5");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
		ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КадровоеПеремещение_Т5";
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.КадровоеПеремещение.ПФ_MXL_Т5";
		ПечатнаяФорма.СинонимМакета = НСтр("ka='Т-5 (Приказ о переводе)';ru='Т-5 (Приказ о переводе)';en='T-5 (transfer order)'");
		
		СформироватьКадровыйПриказ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приказ_Т5";
	КомандаПечати.Представление = НСтр("ka='Т-5 (Приказ о переводе)';ru='Т-5 (Приказ о переводе)';en='T-5 (transfer order)'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
